module.exports = {
    fields: [
        {
            name: 'title',
            config: { boost: 10 }
        }, {
            name: 'body'
        }
    ],
    documents: [
        {
            "title": "وقعیت اقتصادی جنگ",
            "body": "یکی از واقعیت‌های هر جنگی «واقعیت اقتصادی» آن است که معمولا در سایه‌ی ابعاد فاجعه‌بار انسانی آن گم می‌شود. این مطلب با استفاده از نتایج و ابزار یک پژوهش علمی و داده‌های بانک جهانی به بررسی گوشه‌ای از همین واقعیت اقتصادی می‌پردازد .",
            "id": 1
        }, {
            "title": "نگاهی به حامیان «سرخ و سیاه و چپ و راست»",
            "body": "سرکوب خونین اعتراضات دانشجویی ۲۰ تیر دانشگاه تبریز برای بسیاری از عوامل رژیم مانند #مسعود_پزشکیان و محمد حسین فرهنگی، سکوی ارتقای شغلی و رفتن به تهران،‌مجلس و... بود. مروری بر وقایع آن روز،جنایتی که ابعادشان آن تا حد زیادی نامعلوم و ناگفته مانده. ",
            "id": 2
        }, {
            "title": "مقصر کی بود ",
            "body": " مسابقه « مقصر کی بود »، پس از تحقیر شدید نهادهای امنیتی جمهوری اسلامی در جریان کشته شدن #اسماعيل_هنية محدود به درون محافل امنیتی نمانده نگاهی به گزارش دیلی ‌تلگراف و شکافی که اکنون در «امنیت» جمهوری اسلامی دهان گشوده",
            "id": 3
        }
    ],
    tests: [
        {
            what: "find the word %w",
            search: "واقعیت",
            found: 1
        }, {
            what: "find the word %w",
            search: "می‌پردازد",
            found: 1
        }, {
            what: "find the word %w",
            search: "ابعاد",
            found: 2
        }, {
            what: "find the word %w",
            search: "مسعود_پزشکیان",
            found: 1
        },{
            what: "find the word %w",
            search: "دانشجو",
            found: 1
        },{
            what: "never find a word that does not exist, like %w",
            search: "حساسیت",
            found: 0
        }
    ]

}